Revit 2026 API

# ThermalMaterialType Enumeration

---

Represents the thermal material type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ThermalMaterialType
```
```vb
Public Enumeration ThermalMaterialType
```
```cpp
public enum class ThermalMaterialType
```
```fsharp
type ThermalMaterialType
```

| Member name | Value | Description |
| --- | --- | --- |
| Gas | 1 | Thermal material type is gas. |
| Liquid | 2 | Thermal material type is liquid. |
| Solid | 3 | Thermal material type is solid. |
| Undefined | 0 | Thermal material type is undefined. |

#### Reference

Autodesk.Revit.DB Namespace